Repository: taukeet/taukeet
Catalog: lib/l10n/intl_*.arb
Languages: ar, hi, ur

# appTitle
source: taukeet
ar: توقیت
hi: तौकीत
ur: توقیت

# locationText
source: Location
ar: الموقع
hi: स्थान
ur: مقام

# locationIntro
source: Taukeet's accuracy in calculating and providing prayer times depends on your location. Please share your current location for precise results.
ar: تعتمد دقة تطبيق تاوقت في حساب أوقات الصلاة على موقعك. يرجى مشاركة موقعك الحالي للحصول على نتائج دقيقة.
hi: तौकीत की सटीकता प्रार्थना के समय की गणना और प्रदान करने में आपके स्थान पर निर्भर करती है। सटीक परिणामों के लिए कृपया अपना वर्तमान स्थान साझा करें।
ur: نماز کے اوقات کی درستگی اور مہیا کرنے کے لیے توقیت کو آپ کے مقام کی ضرورت ہے۔ درست نتائج کے لیے براہ کرم اپنا موجودہ مقام شیئر کریں۔

# locationIntroNext
source: Thank you for the location, click on "Next" to continue
ar: شكرًا لموقعك، اضغط على "التالي" للمتابعة
hi: स्थान के लिए धन्यवाद, जारी रखने के लिए "अगला" पर क्लिक करें
ur: مقام کا شکریہ، آگے بڑھنے کے لیے "اگلا" پر کلک کریں

# locationIntroBtn
source: Fetch location
ar: جلب الموقع
hi: स्थान प्राप्त करें
ur: مقام حاصل کریں

# locationIntroBtnLoading
source: Fetching location...
ar: جارٍ جلب الموقع...
hi: स्थान प्राप्त हो रहा है...
ur: مقام حاصل کیا جا رہا ہے...

# locationFetchNetworkFail
source: Failed to fetch location. Please check your network and try again.
ar: فشل في جلب الموقع. يرجى التحقق من الشبكة والمحاولة مرة أخرى.
hi: स्थान प्राप्त करने में विफल। कृपया अपना नेटवर्क जांचें और पुनः प्रयास करें।
ur: مقام حاصل کرنے میں ناکامی۔ براہ کرم اپنا نیٹ ورک چیک کریں اور دوبارہ کوشش کریں۔

# madhabIntro
source: You can choose between Hanafi or Standard (Maliki, Shafi'i, Hanbali) calculation methods for Asr prayer times. Hanafi starts Asr later when an object's shadow is twice its length.
ar: يمكنك الاختيار بين المذهب الحنفي أو المعياري (مالكي، شافعي، حنبلي) لحساب وقت صلاة العصر. يبدأ الحنفية العصر لاحقًا عندما يكون ظل الجسم ضعف طوله.
hi: आप अस्र की नमाज़ के समय के लिए हनफ़ी या मानक (मलिकी, शफ़ीई, हंबली) गणना विधियों के बीच चयन कर सकते हैं। हनफ़ी अस्र तब शुरू होती है जब किसी वस्तु की छाया उसकी लंबाई से दोगुनी हो जाती है।
ur: آپ عصر کے وقت کے لیے حنفی یا معیاری (مالکی، شافعی، حنبلی) طریقہ کار میں سے انتخاب کر سکتے ہیں۔ حنفی میں عصر اس وقت شروع ہوتا ہے جب کسی شے کا سایہ اس کی لمبائی کے دوگنا ہو جائے۔

# madhabIntroBtn
source: Change madhab
ar: تغيير المذهب
hi: मज़हब बदलें
ur: مذہب تبدیل کریں

# calculationMethodIntro
source: The calculation methods are algorithms used to determine accurate prayer schedules. To begin, please select one that is near to your location or the one you prefer.
ar: طرق الحساب هي خوارزميات تُستخدم لتحديد أوقات الصلاة بدقة. للبدء، يرجى اختيار الطريقة الأقرب إلى موقعك أو التي تفضلها.
hi: गणना विधियाँ सटीक प्रार्थना कार्यक्रम निर्धारित करने के लिए उपयोग किए जाने वाले एल्गोरिदम हैं। आरंभ करने के लिए, कृपया अपने स्थान के निकट या जिसे आप पसंद करते हैं, उसका चयन करें।
ur: حساب کے طریقے ایسے الگورتھمز ہیں جو درست نماز کے اوقات کے لیے استعمال ہوتے ہیں۔ شروع کرنے کے لیے وہ طریقہ منتخب کریں جو آپ کے مقام کے قریب ہو یا جو آپ ترجیح دیتے ہیں۔

# calculationMethodBtn
source: Change calculation method
ar: تغيير طريقة الحساب
hi: गणना विधि बदलें
ur: طریقہ حساب تبدیل کریں

# disableLocationTitle
source: Warning
ar: تحذير
hi: चेतावनी
ur: خبردار

# disableLocationMessage
source: Location is disabled, please enable to fetch the current location.
ar: الموقع معطل، يرجى تمكينه لجلب الموقع الحالي.
hi: स्थान अक्षम है, कृपया वर्तमान स्थान प्राप्त करने के लिए सक्षम करें।
ur: مقام غیر فعال ہے، موجودہ مقام حاصل کرنے کے لیے اسے فعال کریں۔

# permissionErrorTitle
source: Permission Error
ar: خطأ في الصلاحيات
hi: अनुमति त्रुटि
ur: اجازت کی خرابی

# permissionErrorMessage
source: Taukeet needs location permission to fetch the current location, with current location Taukeet calculates the prayer times.
ar: تحتاج تطبيق تاوقت إلى إذن الموقع لجلب موقعك الحالي، حيث يحسب التطبيق أوقات الصلاة بناءً على موقعك.
hi: तौकीत को वर्तमान स्थान प्राप्त करने के लिए स्थान की अनुमति चाहिए, वर्तमान स्थान के साथ तौकीत प्रार्थना के समय की गणना करता है।
ur: توقیت کو موجودہ مقام حاصل کرنے کے لیے مقام کی اجازت درکار ہے۔ موجودہ مقام کے ساتھ توقیت نماز کے اوقات کا حساب لگاتا ہے۔

source: Cancel
ar: إلغاء
hi: रद्द करें
ur: منسوخ کریں

source: Open settings
ar: افتح الإعدادات
hi: सेटिंग्स खोलें
ur: ترتیبات کھولیں

source: Loading...
ar: جارٍ التحميل...
hi: लोड हो रहा है...
ur: لوڈ ہو رہا ہے...

source: Settings
ar: الإعدادات
hi: सेटिंग्स
ur: ترتیبات

# fetchLocationDesc
source: tap to get the current location
ar: اضغط للحصول على الموقع الحالي
hi: वर्तमान स्थान प्राप्त करने के लिए टैप करें
ur: موجودہ مقام حاصل کرنے کے لیے ٹیپ کریں

# changeMadhabDesc
source: tap to change the madhab
ar: اضغط لتغيير المذهب
hi: मज़हब बदलने के लिए टैप करें
ur: مذہب تبدیل کرنے کے لیے ٹیپ کریں

# changeCalculationMethodDesc
source: tap to change the calculation method
ar: اضغط لتغيير طريقة الحساب
hi: गणना विधि बदलने के लिए टैप करें
ur: طریقہ حساب تبدیل کرنے کے لیے ٹیپ کریں

# changeLattitudeSetting
source: In locations at higher latitude, twilight may persist throughout the night during some months of the year. In these abnormal periods, the determination of Fajr and Isha is not possible using the usual formulas, to overcome this problem, several solutions have been proposed, tap to change the method.
ar: في المواقع ذات خطوط العرض العالية، قد يستمر الشفق طوال الليل خلال بعض الأشهر. خلال هذه الفترات غير الطبيعية، لا يمكن تحديد وقتي الفجر والعشاء باستخدام الصيغ المعتادة. لتجاوز هذه المشكلة، تم اقتراح عدة حلول، اضغط لتغيير الطريقة.
hi: उच्च अक्षांश वाले स्थानों में, वर्ष के कुछ महीनों के दौरान रात भर गोधूलि बनी रह सकती है। इन असामान्य अवधियों में, सामान्य सूत्रों का उपयोग करके फज्र और ईशा का निर्धारण संभव नहीं है, इस समस्या को दूर करने के लिए, कई समाधान प्रस्तावित किए गए हैं, विधि बदलने के लिए टैप करें।
ur: اونچائی والے علاقوں میں، کچھ مہینوں میں رات کے دوران ٹوائلائٹ برقرار رہ سکتی ہے۔ ان غیر معمولی ادوار میں، فجر اور عشاء کا تعین معمول کے فارمولوں سے ممکن نہیں ہے۔ اس مسئلے سے نمٹنے کے لیے مختلف حل تجویز کیے گئے ہیں، طریقہ تبدیل کرنے کے لیے ٹیپ کریں۔

# prayerSdjustments
source: Prayer adjustments
ar: تعديلات الصلاة
hi: प्रार्थना समायोजन
ur: نماز میں تبدیلیاں

# changeAdjustmentsDesc
source: Adjust the prayer times by minutes
ar: اضبط أوقات الصلاة بالدقائق
hi: प्रार्थना के समय को मिनटों में समायोजित करें
ur: نماز کے اوقات میں منٹ کے حساب سے تبدیلی کریں

source: Change language
ar: تغيير اللغة
hi: भाषा बदलें
ur: زبان تبدیل کریں

source: Fajr
ar: الفجر
hi: फज्र
ur: فجر

source: Sunrise
ar: الشروق
hi: सूर्योदय
ur: طلوع آفتاب

source: Dhuhr
ar: الظهر
hi: ज़ुहर
ur: ظہر

source: Asr
ar: العصر
hi: अस्र
ur: عصر

source: Maghrib
ar: المغرب
hi: मग़रिब
ur: مغرب

source: Isha
ar: العشاء
hi: ईशा
ur: عشاء

source: Reset
ar: إعادة ضبط
hi: रीसेट
ur: ری سیٹ کریں

source: Save adjustments
ar: حفظ التعديلات
hi: समायोजन सहेजें
ur: تبدیلیاں محفوظ کریں

# adjustmentsSuccess
source: Adjustments saved successfully
ar: تم حفظ التعديلات بنجاح
hi: समायोजन सफलतापूर्वक सहेजा गया
ur: تبدیلیاں کامیابی کے ساتھ محفوظ ہو گئیں

# adjustmentsResetSuccess
source: Adjustments reset successfully
ar: تمت إعادة ضبط التعديلات بنجاح
hi: समायोजन सफलतापूर्वक रीसेट किया गया
ur: تبدیلیاں کامیابی کے ساتھ ری سیٹ ہو گئیں

source: Muslim World League
ar: رابطة العالم الإسلامي
hi: मुस्लिम वर्ल्ड लीग
ur: مسلم ورلڈ لیگ

# muslimWorldLeagueDesc
source: Muslim World League (MWL) method, usually used in Europe, Far East, and parts of America. Default in most calculators.
ar: طريقة رابطة العالم الإسلامي (MWL)، تُستخدم عادة في أوروبا والشرق الأقصى وأجزاء من أمريكا. هي الافتراضية في معظم الحاسبات.
hi: मुस्लिम वर्ल्ड लीग (MWL) विधि, आमतौर पर यूरोप, सुदूर पूर्व और अमेरिका के कुछ हिस्सों में उपयोग की जाती है। अधिकांश कैलकुलेटर में डिफ़ॉल्ट विधि है।
ur: مسلم ورلڈ لیگ (MWL) طریقہ، عام طور پر یورپ، دورِ مشرق اور امریکہ کے کچھ حصوں میں استعمال ہوتا ہے۔ زیادہ تر کیلکولیٹرز میں ڈیفالٹ۔

source: Egyptian
ar: المصرية
hi: मिस्री
ur: مصر

# egyptianDesc
source: Egyptian General Authority of Survey method, commonly used in Egypt.
ar: طريقة الهيئة العامة للمسح المصرية، تُستخدم غالبًا في مصر.
hi: मिस्र की जनरल अथॉरिटी ऑफ सर्वे विधि, जो मिस्र में सामान्य रूप से उपयोग की जाती है।
ur: Egyptian General Authority of Survey طریقہ، عام طور پر مصر میں استعمال ہوتا ہے۔

source: Karachi
ar: كراتشي
hi: कराची
ur: کراچی

# karachiDesc
source: University of Islamic Sciences, Karachi method, widely used in Karachi, Pakistan.
ar: طريقة جامعة العلوم الإسلامية بكراتشي، مستخدمة على نطاق واسع في كراتشي، باكستان.
hi: इस्लामिक साइंसेज़ विश्वविद्यालय, कराची की विधि, जो कराची, पाकिस्तान में व्यापक रूप से उपयोग होती है।
ur: University of Islamic Sciences, Karachi طریقہ، پاکستان میں کراچی میں وسیع پیمانے پر استعمال ہوتا ہے۔

source: Umm al-Qura
ar: أم القرى
hi: उम्म अल-क़ुरा
ur: ام القریٰ

# ummAlQuraDesc
source: Umm al-Qura University, Makkah method, utilized in Makkah, Saudi Arabia.
ar: طريقة جامعة أم القرى في مكة، مستخدمة في مكة، المملكة العربية السعودية.
hi: उम्म अल-क़ुरा विश्वविद्यालय, मक्का की विधि, जो मक्का, सऊदी अरब में उपयोग की जाती है।
ur: Umm al-Qura University، مکہ طریقہ، سعودی عرب کے مکہ میں استعمال ہوتا ہے۔

source: Dubai
ar: دبي
hi: दुबई
ur: دبئی

# dubaiDesc
source: Dubai method, specific to Dubai, United Arab Emirates.
ar: طريقة دبي، خاصة بدبي، الإمارات العربية المتحدة.
hi: दुबई विधि, विशेष रूप से दुबई, संयुक्त अरब अमीरात के लिए।
ur: دبئی طریقہ، متحدہ عرب امارات کے دبئی کے لیے مخصوص۔

source: Moonsighting Committee
ar: لجنة رؤية الهلال
hi: चाँद देखने की समिति
ur: Moonsighting کمیٹی

# moonsightingCommitteeDesc
source: Moonsighting Committee method, based on moonsighting observations.
ar: طريقة لجنة رؤية الهلال، تعتمد على ملاحظات الهلال.
hi: चाँद देखने की समिति की विधि, जो चाँद के दीदार पर आधारित है।
ur: Moonsighting کمیٹی طریقہ، چاند کے مشاہدات پر مبنی۔

source: North America
ar: أمريكا الشمالية
hi: उत्तर अमेरिका
ur: شمالی امریکہ

# northAmericaDesc
source: Islamic Society of North America (ISNA) method, commonly used in North America.
ar: طريقة الجمعية الإسلامية لأمريكا الشمالية (ISNA)، تُستخدم عادة في أمريكا الشمالية.
hi: इस्लामिक सोसाइटी ऑफ नॉर्थ अमेरिका (ISNA) की विधि, जो उत्तर अमेरिका में आमतौर पर उपयोग होती है।
ur: Islamic Society of North America (ISNA) طریقہ، عام طور پر شمالی امریکہ میں استعمال ہوتا ہے۔

source: Kuwait
ar: الكويت
hi: कुवैत
ur: کویت

# kuwaitDesc
source: Kuwait method, commonly used in Kuwait.
ar: طريقة الكويت، تُستخدم غالبًا في الكويت.
hi: कुवैत विधि, जो कुवैत में आमतौर पर उपयोग होती है।
ur: کویت طریقہ، عام طور پر کویت میں استعمال ہوتا ہے۔

source: Qatar
ar: قطر
hi: क़तर
ur: قطر

# qatarDesc
source: Qatar method, specific to Qatar.
ar: طريقة قطر، خاصة بقطر.
hi: क़तर विधि, जो विशेष रूप से क़तर में उपयोग होती है।
ur: قطر طریقہ، قطر کے لیے مخصوص۔

source: Singapore
ar: سنغافورة
hi: सिंगापुर
ur: سنگاپور

# singaporeDesc
source: Singapore method, specific to Singapore.
ar: طريقة سنغافورة، خاصة بسنغافورة.
hi: सिंगापुर विधि, जो विशेष रूप से सिंगापुर में उपयोग होती है।
ur: سنگاپور طریقہ، سنگاپور کے لیے مخصوص۔

source: Turkey
ar: تركيا
hi: तुर्की
ur: ترکی

# turkeyDesc
source: Turkey method, specific to Turkey.
ar: طريقة تركيا، خاصة بتركيا.
hi: तुर्की विधि, जो विशेष रूप से तुर्की में उपयोग होती है।
ur: ترکی طریقہ، ترکی کے لیے مخصوص۔

source: Tehran
ar: طهران
hi: तेहरान
ur: تہران

# tehranDesc
source: Tehran method, specific to Tehran.
ar: طريقة طهران، خاصة بطهران.
hi: तेहरान विधि, जो विशेष रूप से तेहरान में उपयोग होती है।
ur: تہران طریقہ، تہران کے لیے مخصوص۔

source: Other
ar: أخرى
hi: अन्य
ur: دیگر

# otherDesc
source: Other or generic calculation method with no specific parameters.
ar: طريقة حساب أخرى أو عامة بدون معايير محددة.
hi: अन्य या सामान्य गणना विधि, जिसमें कोई विशिष्ट पैरामीटर नहीं होते।
ur: دیگر یا عمومی حساب کا طریقہ بغیر کسی مخصوص پیرامیٹر کے۔

source: None
ar: لا شيء
hi: कोई नहीं
ur: کوئی نہیں

# noneDesc
source: No special latitude adjustment is applied.
ar: لا يتم تطبيق أي تعديل خاص بخط العرض.
hi: कोई विशेष अक्षांश समायोजन लागू नहीं किया गया है।
ur: کوئی خاص latitude adjustment لاگو نہیں۔

source: Middle of the Night
ar: منتصف الليل
hi: आधी रात
ur: رات کے درمیان

# middleOfTheNightDesc
source: Fajr will never be earlier than the middle of the night and Isha will never be later than the middle of the night.
ar: لن يكون الفجر قبل منتصف الليل ولن يكون العشاء بعد منتصف الليل.
hi: फज्र कभी भी आधी रात से पहले नहीं होगा और ईशा कभी भी आधी रात के बाद नहीं होगा।
ur: فجر کبھی رات کے درمیان سے پہلے نہیں ہوگی اور عشاء کبھی رات کے درمیان کے بعد نہیں ہوگی۔

source: Seventh of the Night
ar: السابع من الليل
hi: रात का सातवाँ हिस्सा
ur: رات کا ساتواں حصہ

# seventhOfTheNightDesc
source: Fajr will never be earlier than the beginning of the last seventh of the night and Isha will never be later than the end of the first seventh of the night.
ar: لن يكون الفجر قبل بداية السابع الأخير من الليل ولن يكون العشاء بعد نهاية السابع الأول من الليل.
hi: फज्र कभी भी रात के अंतिम सातवें हिस्से की शुरुआत से पहले नहीं होगा और ईशा कभी भी रात के पहले सातवें हिस्से के अंत के बाद नहीं होगा।
ur: فجر کبھی رات کے آخری ساتویں حصہ کے شروع سے پہلے نہیں ہوگی اور عشاء کبھی پہلے ساتویں حصہ کے اختتام کے بعد نہیں ہوگی۔

source: Twilight Angle
ar: زاوية الشفق
hi: संध्याकाल कोण
ur: ٹائیلائٹ زاویہ

# twilightAngleDesc
source: Similar to Seventh of the Night, but instead of 1/7, the fraction of the night used is fajrAngle/60 and ishaAngle/60.
ar: مماثل للسابع من الليل، لكن بدل 1/7، يتم استخدام جزء الليل كـ fajrAngle/60 و ishaAngle/60.
hi: रात का सातवाँ हिस्सा विधि के समान है, लेकिन 1/7 की बजाय रात का अंश फज्र कोण/60 और ईशा कोण/60 पर आधारित होता है।
ur: ساتویں حصے کے مماثل، لیکن 1/7 کی بجائے رات کا حصہ fajrAngle/60 اور ishaAngle/60 استعمال ہوتا ہے۔

# hanafi
source: Hanfi
ar: حنفي
hi: हन्फी
ur: حنفی

# hanafiDesc
source: Later Asr Time
ar: وقت العصر متأخر
hi: बाद में अस्र का समय
ur: بعد میں عصر کا وقت

# shafi
source: Standard
ar: معياري
hi: मानक
ur: معیاری

# shafiDesc
source: Malki, Shafi, Hanbali - Earlier Asr Time
ar: مالكي، شافعي، حنبلي - وقت العصر مبكر
hi: मालिकी, शाफ़ी, हंबली - अस्र का पहले का समय
ur: مالکی، شافعی، حنبلی - جلدی عصر کا وقت
